spec/fixtures/soap/xml/IControl/LocalLB/ProfileHttpClass/IControl.LocalLB.ProfileHttpClass.add_header_match_pattern_e789a41b9f004868f5ef37b5a46a5d70_request.xml

<?xml version="1.0" encoding="UTF-8"?><env:Envelope xmlns:env="http://schemas.xmlsoap.org/soap/envelope/" xmlns:wsdl="urn:iControl:LocalLB/ProfileHttpClass"><env:Body><wsdl:add_header_match_pattern><profile_names><value>test_profile2</value></profile_names><patterns><item><value><pattern>test_header</pattern><is_glob>true</is_glob></value></item></patterns></wsdl:add_header_match_pattern></env:Body></env:Envelope>